do
ws = {}
rs = {}

-- some examples of how to use this :3
ws[1] = "هلو" -- msg 
rs[1] = "هلوات عيني😜" -- reply

ws[2] = "شلونكم" -- msg
rs[2] = " احسن منك 😂" -- reply

ws[3] = "نجب" -- msg
rs[3] = "يخي اتجاوزك بخلاقي😑" -- reply

ws[4] = "احبك" -- msg 
rs[4] = "حبك برص😒" -- reply

ws[5] = "تحبني" -- msg 
rs[5] = "احب وسبر😍 وميكو😍 واوفي😍 وبس😍" -- reply

ws[6] = "ماحب منتظر" -- msg 
rs[6] = "هسه اكله المنتظر عليك😈 @memo_cool ⚠️ " -- reply

ws[7] = "احبج" -- msg 
rs[7] = "يخي احترم شعوري😢" -- reply

ws[8] = "واكف" -- msg 
rs[8] = "يخي مابيه شي ليش تتفاول😢" -- reply

ws[9] = "@memo_cool" -- msg 
rs[9] = "يخي نايم بعليك😂 من يجي اكله" -- reply

ws[10] = "البوت واكف" -- msg 
rs[10] = "هياتني 😐" -- reply 

ws[11] = "صدك" -- msg 
rs[11] = "متشاقي وياك كبل😕" -- reply

ws[12] = "اريد كروب" -- msg 
rs[12] = "☺تضيف 30 عضو بي" -- reply

ws[13] = "منتظر" -- msg 
rs[13] = "هاذا حبيبي❤️😘"  -- reply

ws[14] = "لك معليك اني و ضلعي" -- msg 
rs[14] = "😐اوك اثف"  -- reply

ws[15] = "😂" -- msg 
rs[15] = " •❤•فٌدِيـ❤ـِـْْت هلضحكه•❤•"

ws[16] = "وكف البوت" -- msg 
rs[16] = "😐 شلون راح اطردك" -- reply

ws[17] = "كم بي" -- msg 
rs[17] = "😴لتتلزك" -- reply

ws[1888] = "دي" -- msg 
rs[1888] = "👺خليني حبك" -- reply

ws[19] = "مرحبا" -- msg 
rs[19] = "مراحب نورت عيني😌" -- reply

ws[20] = "زيوني" -- msg 
rs[20] = "يموت علة صدر احمد حسن😂👌" -- reply

ws[21] = "اي اضيف" -- msg 
rs[21] = "روحلة خاص @memo_cool" -- reply

ws[22] = "انجب" -- msg 
rs[22] = "يخي اتجاوزك بخلاقي😑" -- reply

ws[23] = "كحاب" -- msg 
rs[23] = "امك وخواتك😈 لتجاوز تنطرد" -- reply

ws[24] = "افلش" -- msg 
rs[24] = "باند عام من 30 بوت😉" -- reply

ws[25] = "زغيرونتي" -- msg 
rs[25] = " احلى من الكمر وشويه اضوه 😍🖐" -- reply

ws[26] = "ورده" -- msg 
rs[26] = "قندرتك فرده وفرده 😂" -- reply

ws[27] = "كرار" -- msg 
rs[27] = "ابو فليس😕" -- reply

ws[28] = "بوت" -- msg 
rs[28] = "؏ـيــ❦ـونةة بوت 😻❤️" -- reply

ws[29] = "بوسني" -- msg 
rs[29] = "ممممممممممححححح😍😘💋" -- reply

ws[30] = "عبك" -- msg 
rs[30] = "اخرب عليك😍💋" -- reply

ws[31] = "تعال اتزوجك" -- msg 
rs[31] = "ايييي يله هاج معبس💍😍" -- reply

ws[32] = "حبيبي" -- msg 
rs[32] = "عيون حبيبي😍" -- reply

ws[33] = "تحبني لو لا" -- msg 
rs[33] = "اي شعندي غيرج ملاك😍" -- reply

ws[34] = "يومه فدوه" -- msg 
rs[34] = "فدؤه الج حياتي 😍😙" -- reply

ws[35] = "شلونك بوت" -- msg 
rs[35] = " الحمد لله وانت😍😙" -- reply

ws[36] = "حياوي" -- msg 
rs[36] = " واحد يستحي يدز صورته هههههه🖐" -- reply

ws[37] = "مصطفى"
rs[37] = " واحد ظاغط بنات الكروب 🌚🖐"

ws[38] = "علي تركي"
rs[38] = "واحد عصبي😡 وميتفاهم😐"

ws[39] = "ضلعه"
rs[39] = " انجب مو ضلعتك/ج اني 🙌"

ws[40] = "ضلع"
rs[40] = "انجب مو ضلعك/ج  اني 🙌"

ws[41] = "غبي"
rs[41] = "مو اغبه منك 😒"

ws[42] = "تف"
rs[42] = "عيب ابني تتفل اكبر شوية 🌚😂"

ws[43] = "امداج"
rs[43] = "امداج انتي😐"

ws[44] = "امداك"
rs[44] = " امداك انت 😒"

ws[45] = "عمار باسم"
rs[45] = "ابو حنج😂😂"

ws[46] = "هع"
rs[46] = " هعهاعه التهعهع عظامك😂😂✋🏿"

ws[47] = "معليك"
rs[47] = " عليه ونص 😂"

ws[48] = "لتحجي"
rs[48] = " وانت شعليك حاجي من حلگگ😒"

ws[49] = "اكلك"
rs[49] = "كلي وما كول لاحد 😉"

ws[50] = "ضوجه"
rs[50] = "شسوي اركصلك ؟"

ws[51] = "احترم نفسك"
rs[51] = "احترمه انته بل بدايه 😶"

ws[52] = "تعالي خاص"
rs[52] = "ها شسون 😉"

ws[53] = "تعال خاص"
rs[53] = "ها شسون 😉"

ws[54] = "بوسني" -- msg 
rs[54] =  "مووواح فدوه لربك❤️🙈" -- reply 

ws[5555] = "حبي" -- msg 
rs[5555] =  "ها حياتي😻❤️" -- reply 

ws[5666] = "ميمو" -- msg 
rs[5666] = "هذا الي صنعني فديت ربه 🙈❤️" -- reply 

ws[57] = "شلونكم" -- msg 
rs[57] = " تمام حياتي وانت شلونك😍❤️" -- reply 

ws[5877] = "ضوجة" -- msg 
rs[5877] = "شي اكيد الكبل ماكو 😂 لو بعدك/ج مازاحف/ة 🙊😋" --reply 

ws[59] = "زاحف" -- msg 
rs[59] = "زاحف على خالتك/ج الشكره️😝😂🙌" 

ws[6233] = "حبك" -- msg 
rs[6233] ="خخ فدوه اروحلك انا امواح🙈❤️" 

ws[61] = "انجب" -- msg 
rs[61] =" صار اغاتي انجبيت😷💛️" -- 

ws[6255] = "اتحبني" -- msg 
rs[6255] =" شعندي غيرك/ج يبعد رويحتي😻❤️️" -- 

ws[53] = "منو صنعك" -- msg 
rs[53] =" ميمو فديت ربة مموح😻❤️️" -- 

ws[54] = "باي" -- msg 
rs[54] ="بايات حياتي انته الله وياك👋😽️" 

ws[55] = "اريد بوت حماية" -- msg 
rs[55] =" أرسلني هنا @devss_bot❤️😍️" 

ws[56] = "هلو" -- msg 
rs[56] ="هلوات على النبي😹" 

ws[57] ="دي" -- msg 
rs[57] ="ديييييات" 

ws[58] = "شكد" -- msg 
rs[58] ="اكثر من ما تتصور😍😍❤️️" 

ws[59] = "اريد اكبل" -- msg 
rs[59] =" خخ اني هم اريد اكبل قابل ربي وحد😹🙌️" 

ws[60] = "اتفل" -- msg 
rs[60] ="تففففففف عليج"

ws[61] = "شلونك" -- msg 
rs[61] ="تمام بحي وانت/ي شلونك😍😍😍️️" 

ws[62] ="البوت واكف" -- msg 
rs[62] ="دافع الاشتراك 3$" 

ws[63] ="كول والله" -- msg 
rs[63] ="واللهتين" 

ws[64] = "تخليني" -- msg 
rs[64] ="عيب منا عالم تعال وره ال 12 كلها نايمه😉️️" 

ws[65] ="كروب دعم" -- msg 
rs[65] ="مو هسة"

ws[66] = "اكرهك" -- msg 
rs[66] ="موووواح شلون بوسه عسل والله عسل افيش 😍❤️️" 

ws[67] = "شكو ماكو" -- msg 
rs[67] ="غيرك/ج بل كلب ماكو يبعد كلبي😍❤️️" 

ws[68] = "اكلك" -- msg 
rs[68] ="كول يعمري😍❤️️"

ws[69] = "دقيقة" -- msg 
rs[69] ="صار 🕜 ساعة مو دقيقة😍❤️️"

ws[70] = "اوكف" -- msg 
rs[70] ="وكفت 💃😍❤️️"

ws[71] = "اروح اصلي" -- msg 
rs[71] ="انته حافظ سوره الفاتحة😍❤️️"

ws[72] = "الاوامر" -- msg 
rs[72] ="لظهار لاوامر دز مساعدة😍❤️️"

ws[73] = "help" -- msg 
rs[73] ="لظهار الاوامر دز مساعدة😍❤️️"

ws[80] = "تركماني"
rs[80] = " والنعم منك❤️"

ws[81] = "يا سورس هذا"
rs[81] = "ديف بوينت"

ws[83] = "باي"
rs[83] = " بايات ❤️🍃"

ws[84] = "تنح"
rs[84] = "عيب ابني 😒🍃"

ws[85] = "جوعان"
rs[85] = "تعال اكلني 😐😂"

ws[86] = "عطشان"
rs[86] = "روح اشرب مي"

ws[87] = "صايم"
rs[87] = "شسويلك 😐🍃"

ws[88] = "☹️"
rs[88] = "لضوج حبيبي 😢❤️🍃"

ws[89] = "😔"
rs[89] = " ليش الحلو ضايج ❤️🍃"

ws[90] = "فرخ"
rs[90] = " عيبب 😱😱"

ws[92] = "كسمك"
rs[92] = " عيب 😱😱😱"

ws[93] = "نعال"
rs[93] = " بوجهك 😐😂"

ws[94] = "حروح اسبح"
rs[94] = " واخيراً 😂"

ws[95] = "حروح اغسل"
rs[95] = " واخيراً 😂"

ws[96] = "حروح اطب للحمام"
rs[96] = " واخيراً 😂"

ws[97] = "حبيبتي"
rs[97] = " منو هاي 😱 تخوني 😔☹"

ws[98] = "كبلت"
rs[98] = " بلخير 😂💔"

ws[99] = "البوت عاوي"
rs[99] = " اطردك ؟ 😒"

ws[100] = "منور"
rs[100] = " بنورك حبي 😍🍷"

ws[101] = "حفلش"
rs[101] = " افلش راسك"

ws[102] = "كردي"
rs[102] = "والنعم منك ❤️"

ws[103] = "طفي السبلت"
rs[103] = " تم اطفاء السبلت بنجاح 🌚🍃"

ws[104] = "🌝"
rs[104] = "هه"

ws[105] = "اذن المغرب"
rs[105] = "استحرم 🌚🍃"

ws[106] = "حلو"
rs[106] = "انت الاحلى 🌚❤️"

ws[107] = "احبك"
rs[107] = " اني اكثر 😍🍃"

ws[108] = "😑"
rs[108] = " شبيك 🍃☹"

ws[109] = "😒"
rs[109] = "😐 شبيك كالب وجهك "

ws[110] = "منو تحب"
rs[110] = "خالتك الشكرة"

ws[111] = "اباجر العيد"
rs[111] = "كل عام وانت بالف خير حبي 😇❤️"

ws[112] = "فديت"
rs[112] = "ها  زاحف كمشتك"

ws[113] = "مضغوط"
rs[113] = "دي انضغظ منك ؟ 😂😂"

ws[114] = "فديت"
rs[114] = "ها  زاحف كمشتك"

ws[115] = "فديتك"
rs[115] = "ها  زاحف كمشتك"

ws[116] = "فديتج"
rs[116] = "ها  زاحف كمشتك"

ws[117] = "شوف خاصك"
rs[117] = "شدازله 😱😨"

ws[118] = "تعال خاص"
rs[118] = "شحسوون 😱"

ws[119] = "تعالي خاص"
rs[119] = "شحسوون 😱"

ws[120] = "دخل السبام"
rs[120] = "شحسوون 😱"

ws[121] = "😎"
rs[121] = "يلا عود انته فد نعال 😐🍃"

ws[122] = "😱"
rs[122] = "خير خوفتني 😨"

ws[123] = "كحبه"
rs[123] = "عيب 😱"

ws[124] = "بيش ساعة"
rs[124] = "ما اعرف 🌚🍃"

ws[125] = "🚶🏻"
rs[125] = "خير 🌝"

ws[126] = "منو اكثر واحد تحبه"
rs[126] = "خالتك"

ws[127] = "ليش"
rs[127] = "تاكل خرة الجيش 😂😂"

ws[128] = "طاسه"
rs[128] = "امك حلوة ورقاصه 💃🏻"

ws[129] = "عشرين"
rs[129] = "تاكل جدر خنين 😫"

ws[130] = "ميه"
rs[130] = "😂تشرب مميه"

ws[131] = "اربعة"
rs[131] = "😂لحيه ابوك مربعه"

ws[132] = "فارة"
rs[132] = "😂دفترك كله صفارة"

ws[133] = "ميتين"
rs[133] = "😂فوك راسك قندرتين"

ws[134] = "مات"
rs[134] = "ابو الحمامات 🐦"

ws[135] = "توفه"
rs[135] = "ابو اللفه 🌯"

ws[136] = "احترك"
rs[136] = "🍾البو العرك"

ws[137] = "غرك"
rs[137] = "ابو العرك 🍾"

ws[138] = "طار"
rs[138] = "ابن الطيار"

ws[139] = "ديسحك"
rs[139] = "😂😂 هاي بعده"

ws[140] = "لتسحك"
rs[140] = "😐😂 وك"

ws[141] = "اندرويد"
rs[141] = "افشل نظام بلعالم 🌝🍷"

ws[142] = "ios"
rs[142] = "احسن نظام بلعالم🌚❤️"

ws[143] = "ايفون"
rs[143] = "فديتك اته والايفون 🌚🔥"

ws[144] = "كلكسي"
rs[144] = "فاشل اخرة نوع تلفون🔥☹"

ws[145] = "سامسونك"
rs[145] = "فاشل اخرة نوع تلفون🔥☹"

ws[146] = "لتزحف"
rs[146] = "وك اسف 🙁😔"

ws[147] = "حاته"
rs[147] = "زاحف 😂 منو هاي دزلي صورتهه"

ws[148] = "حات"
rs[148] = "زاحفه 😂 منو هذا دزيلي صورته"

ws[149] = "صاكه"
rs[149] = "زاحف 😂 منو هاي دزلي صورتهه"

ws[150] = "صاك"
rs[150] = "زاحفه 😂 منو هذا دزيلي صورهه"

ws[151] = "منو اني"
rs[151] = "انته احلى شي بحياتي ❤️🍃"

ws[152] = "ابن الكلب"
rs[152] = "عيب ابني 🔥☹"

ws[153] = "انجب انته"
rs[153] = "وك وك 😭😔"

ws[154] = "حطردك"
rs[154] = "اعصابك 😨 لتتهور"

ws[155] = "المطور"
rs[155] = "شتريد من المطور 😐🍃"

ws[156] = "منو اكثر واحد تكرهه"
rs[156] = "انته"

ws[157] = "شباب"
rs[157] = "نعم حبي 🌝❤️"

ws[158] = "اته زلمه"
rs[158] = "تعال لزمه 😐😂"

ws[159] = "الاحد"
rs[159] = "هذا اليوم نحس بلنسبه الي"

ws[160] = "الاثنين"
rs[160] = "يوم اجة بي ناس عزيزين وفقدت بي ناس هم ☹"

ws[161] = "هلاوو"
rs[161] = "هلاوات ❤️🍃"

ws[162] = "اختك"
rs[162] = "شبيهه 😱"

ws[163] = "كواد"
rs[163] = "عيب 😨😨"

ws[164] = "😌"
rs[164] = "المطلوب ؟"

ws[165] = "هلا"
rs[165] = " 🌚🍃هلاوات"

ws[166] = "مرحبا"
rs[166] = "مرحبتين 😍🍃"

ws[167] = "سلام"
rs[167] = "السلام عليكم 🌝🍃"

ws[168] = "السلام"
rs[168] = "السلام عليكم 🌝🍃"

ws[169] = "السلام عليكم"
rs[169] = "عليكم السلام 🌝🍃"

ws[170] = "تسلم"
rs[170] = "الله يسلمك 😍"

ws[171] = "هلو" -- msg 
rs[171] ="هلوات على النبي😹" 
 
ws[172] ="دي" -- msg 
rs[172] ="ديييييات" 

ws[173] = "شكد" -- msg 
rs[173] ="اكثر من ما تتصور😍😍❤️️" 

ws[174] = "اريد اكبل" -- msg 
rs[174] =" خخ اني هم اريد اكبل قابل ربي وحد😹🙌️" 

ws[175] = "اتفل" -- msg 
rs[175] ="ختفوووووووووو💦💦️️"

ws[176] = "شلونك" -- msg 
rs[176] ="تمام بحي وانت/ي شلونك😍😍😍️️" 

ws[177] ="البوت واكف" -- msg 
rs[177] ="دافع الاشتراك 3$" 

ws[178] ="كول والله" -- msg 
rs[178] ="واللهتين" 

ws[179] = "تخليني" -- msg 
rs[179] ="عيب منا عالم تعال وره ال 12 كلها نايمه😉️️" 

ws[180] ="كروب دعم" -- msg 
rs[180] =" مو هسة "

ws[180] = "اكرهك" -- msg 
rs[180] ="موووواح شلون بوسه عسل والله عسل افيش 😍❤️️" 

ws[181] = "شكو ماكو" -- msg 
rs[181] ="غيرك/ج بل كلب ماكو يبعد كلبي😍❤️️" 

ws[182] = "اكلك" -- msg 
rs[182] ="كول يعمري😍❤️️"

ws[183] = "دقيقة" -- msg 
rs[183] ="صار 🕜 ساعة مو دقيقة😍❤️️"

ws[184] = "اوكف" -- msg 
rs[184] ="وكفت 💃😍❤️️"

ws[185] = "اروح اصلي" -- msg 
rs[185] ="انته حافظ سوره الفاتحة😍❤️️"

ws[186] = "الاوامر" -- msg 
rs[186] ="لظهار لاوامر دز مساعدة😍❤️️"

ws[187] = "help" -- msg 
rs[187] ="لظهار الاوامر دز مساعدة😍❤️️"

ws[188] = "بوت منو هشام" -- msg 
rs[188] ="امم واحد شاخط بس حباب ونتة تعشق صوتة"

ws[233] = "احمد حسن" -- msg
rs[233] = "زاحف👆🐍"

ws[9898] = "اريد ماي" -- msg
rs[9898] = "اشتغل عد الخلفوك"

ws[2322] = "اكولج" -- msg
rs[2322] = "اكو مطي بحلج"

ws[1123] = "وعير" -- msg
rs[1123] = "اللطمك😐 اذا تتجاز اركعك بالنعال😒"

ws[11123] = "شنو يعني كومة" -- msg
rs[11123] = "يعني الامان 😂 والاستقرار😜✌🏻"

ws[111233] = "تسلم" --msg
rs[111233] = "تدلل 😍"

ws[11233] = "😐" --msg
rs[11233] = "شبيك صافن 🔥😒"

ws[221122] = "اريد شعر" --msg
rs[221122] = "بيدك تفك الباب بيدك تسدة✋ بيدك تسد الباب بيدك تفكة😜✌🏻"

ws[2233242] = "انت نجب😒😒"
rs[2233242] = "انتة انجب لا انعل والديك"

ws[2233252] = "خوية السالفة شنو"
rs[2233252] = "اني وصاحبي كاعدين بالكهوة 😌 ربط وبيدة 27😳 كبت عندي لله وكبل كبنتة😡"

ws[2233262] = "ماركس"
rs[2233262] = "وش تبي "

ws[2000002] ="تفو"
rs[2000002] ="تفو عليك"

-- the main function
function run( msg, matches )
-- just a local variables that i used in my algorithm 
local i = 0; local w = false

-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
for k,v in pairs(ws) do
-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
-- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
i = k; w = true;
end
end

-- check if { w } is not false and { i } not equals to 0
if ( (w ~= false) and (i ~= 0) ) then
-- get the receiver :3 
R = get_receiver(msg)
-- send him the proper message from the index that { i } assigned to
--send_large_msg ( R , rs[i] );
--send_reply(msg.id, rs[i])
reply_msg(msg.id, rs[i], ok_cb, false )
end

-- don't edit this section
if ( msg.text == "about" ) then
if ( msg.from.username == "memo" ) then
R = get_receiver(msg)
send_large_msg ( R , "Made by @memo_cool");
end
end 

end



return {
patterns = {
"(.*)" 
},
run = run
} 


end

--Dev:> ṂṜẌ .. @memo_cool