

do

local function run(msg, matches)
if is_sudo(msg) and matches[1]== "dev" then
return [[
اوامر المطور ☠
*************
تفعيل البوت 🤖
تعطيل البوت 😞
تغعيل لمدة + الايام ¹ـ²ـ³
المدة المتبقية  😱
سوبر + تحويل خارقة 😌
ارفع المدير _<معرف_بلرد>👤
حظر عام _<معرف_بلرد> 🖕
الغاء العام _<ايدي>😉

المحظورين عام_💦 
معلومات المجموعة💾
اذاعة _ 🛰
غادر_ لمغادرة البوت🌚 
جلب ملف +الاسم 💥
ـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَ
اوامر تحكم بعدادات البوت ⏰
دخول +الرابط_اضافة لكروب ع الرابط👻 
رسالة+الايدي+الرسالة😐 
وضع صوره للبوت 🙉

جهات الاتصال_جلب الجهات 👍
اضافة جهة اتصال + الجهة 😕
حذف جهة الاتصال + الجهة🌝ة ™
********************** 
اي شي تحتاجة راسل المطورين 
--Dev:> ṂṜẌ .. @memo_cool
--Dev:> @K_R_A_l_J
]]
end

if not is_sudo(msg) then
return "بطورين فقط 😐⛔️"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(dev)"
},
run = run 
}
end
