
--Dev:> ṂṜẌ .. @memo_cool

do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "m3" then
return [[

اوامر الحماية في المجموعة ☠
ـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَ
📘يستخدم
🔐قفل _ للقفل
🔓فتح _ للفتح
ـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَ

💎الروابط _ 💫
💎التكرار _ 💫
💎السبام _ 💫

💎العربية _ 💫
💎الانكلش _ 💫
💎الدخول _ 💫
💎الدخول عبر الرابط _💫
💎اشعارات الدخول _ 💫
💎الاضافة _ 💫
💎 المغادرة _💫
💎اليوزنيم _ (@) 💫
💎التاك _ (#) 💫

💎الرد _ 💫
💎الكلمات السيئة _ 💫
💎الحماية _ 💫
ـَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَ

اي شي تحتاجة راسل المطورين 
--Dev:> ṂṜẌ .. @memo_cool
--Dev:> @K_R_A_l_J
]]
end

if not is_momod(msg) then
return "Only managers 😐⛔️"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(m3)"
},
run = run 
}
end

--Dev:> ṂṜẌ .. @memo_cool
