--Dev:> ṂṜẌ .. @memo_cool

do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "m4" then
return [[
اوامر حماية الميديا ♏️
ـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَ
🔐قفل _ للقفل 
🔓فتح _ للفتح 
ـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَ
💎الميديا_ 🌚
💎اعادة توجيه _🖕
💎السمايلات _ 😻😸
💎البوتات _ 👾🤖
💎جهات الاتصال _ 🔗
💎الصور _ ™🌆
💎الملصقات _😒
💎البصمات _ 🗣
💎المتحركة _ 👀
💎الفيديو _ 🎥
💎النص _💱
💎الدردشة _ 
****************
اي شي تحتاجة راسل المطورين 
--Dev:> ṂṜẌ .. @memo_cool
--Dev:> @K_R_A_l_J
]]
end

if not is_momod(msg) then
return "Only managers 😐⛔️"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(m4)"
},
run = run 
}
end
