

do 

function run(msg, matches) 
return "👋 اهلا بك يا : "..msg.from.print_name.."\n\n"
.."[✋🏽توجد هناك .5. قوائم للاوامر]".."\n" 
.."ا➖🔹➖🔸➖🔹➖".."\n" 
.."🔹-m1 — اوامر ادارة المجموعة ".."\n" 
.."🔹-m2 — اوامر العامة المجموعة".."\n" 
.."🔹-m3— اوامر الحماية (1) للمجموعة ".."\n" 
.."🔹-m4- اوامر الحماية (2) للمجموعة  ".."\n" 
.."🔹-dev- لعرض اوامر المطور".."\n" 
.."ا➖🔹➖🔸➖🔹➖".."\n" 
..
 
*******
اي شي تحتاجة راسل المطورين 
--Dev:> ṂṜẌ .. @memo_cool
--Dev:> @K_R_A_l_J
end 

return { 
  description = "Shows bot help", 
  patterns = { 
    "^الاوامر$", 
    "^مساعدة$",
    "^help$"
  }, 
  run = run 
} 

end 
